# Birthday attendance

* Source: http://orhancanceylan.com/facebook/data/science/interview/2020/05/17/sql_facebook_student-attendance.html
* Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082        

Given the following two tables, write a query to return the fraction of students, rounded to two decimal places, who attended school (attendance = 1) on their birthday.

In [2]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
10 rows affected.
10 rows affected.
 * postgresql://fknight:***@localhost/postgres
Done.
Done.
4 rows affected.
4 rows affected.

# Part A

Create a join query that shows attendance for each student, on their birthday.

In [27]:
%%sql

SELECT a.student_id, attendance, date_of_birth, school_date
FROM attendance a
JOIN students s
ON a.student_id = s.student_id
AND EXTRACT(month FROM s.date_of_birth) = EXTRACT(month FROM a.school_date)
AND EXTRACT(day FROM s.date_of_birth) = EXTRACT(day FROM a.school_date)

 * postgresql://fknight:***@localhost/postgres
3 rows affected.

[(1, 0, datetime.date(2012, 4, 3), datetime.date(2020, 4, 3)),
 (2, 1, datetime.date(2013, 4, 4), datetime.date(2020, 4, 4)),
 (3, 1, datetime.date(2014, 4, 5), datetime.date(2020, 4, 5))]

# Part B

Modify the join query provided to find the solution to the original problem.

```sql
SELECT *
FROM attendance a
JOIN students s
ON a.student_id = s.student_id
AND EXTRACT(month FROM s.date_of_birth) = EXTRACT(month FROM a.school_date)
AND EXTRACT(day FROM s.date_of_birth) = EXTRACT(day FROM a.school_date)
```

## The full solution is given below

In [2]:
%%sql

-- join attendance and students table on student ID, 
-- and day and month of school day = day and month of birthday, 
-- summing ones in attendance column, 
-- dividing by total number of entries, and rounding

SELECT round(1.0*sum(attendance)/count(*), 2) AS birthday_attendance 
FROM attendance a
JOIN students s
ON a.student_id = s.student_id
AND extract(MONTH FROM school_date) = extract(MONTH FROM date_of_birth)
AND extract(DAY FROM school_date) = extract(DAY FROM date_of_birth)

 * postgresql://fknight:***@localhost/postgres
1 rows affected.

[(Decimal('0.67'),)]